name_list = ['강정수', '곽효선', '김동영', '김진영', '김혛규', '남지수', '문수민', '박단비',
             '박종혁', '백재희', '안현성', '이상수', '이해진', '임규환', '임솔이', '전근렬',
             '전인구', '전지환', '조인화', '주진홍', '최용수', '편수지']


# name_list = ['전지환', ]

letter = '''
아가준수 에게..

안녕 나는 너의 마니또야.. 

이렇게 너에게 편지를 쓰게 되었네..

일단 온라인 강의 시간에 너의 드립은 정말 재밌더라 ㅋㅋㅋ 항상 고마워

그리고 남들은 과자도 많이 주던데 그동안 해주게 없어서 미안해..

아마 너는 내가 누군지 정말 상상조차 할 수 없을거야 ㅋㅋ

조금도 눈치 못 챘을걸?

지금도 다른 사람인척 쓰고 있단다 ㅎㅎ

내가 꽁꽁 숨겼거든 ㅎㅎ

그래도 마니또에 임하는 마음가짐은 누구보다 좋아서 너를 항상 뒤에서 응원했어..

따로 정해준 규칙이나 규정이 없어서 더 그런거 같아...

이러한 환경에서도 나는 너를 항상 뒤에서 응원 하고 있단다..

마니또가 끝나도 항상 친하게 지내자

남은 기간동안 수업 열심히 듣고, 몸 관리 잘하기 바랄게 화이팅!!

너의 마니또가..

'''

candidate = []
for student_name in name_list:
    idx = 0
    for c in letter:
        if student_name[idx] == c:
            idx += 1
        if idx == 3:
            candidate.append(student_name)
            break
print(*candidate)

# SSAFY 구미캠퍼스 PYTHON 1반은 '마니또'라는 게임을 진행 중이다!
# 게임 중 작은 미션으로 반 전원은 마니또에게 자신의 이름이 숨겨진 편지를 전달해야 한다.
# 현성이가 전달받은 편지에는 다음과 같은 문구가 적혀있었다.
# '강용황제갈김허임이게뭔개소리야박근주인남전영진짜곽도조환백수광종최희화홍호편재현규형해옥구슬솔민달팽정지상렬창렬'
# 마니또에게서 받은 편지를 해독하고 마니또를 찾아내는 프로그램을 작성하시오.
# 입력:
# 마니또에게서 받은 편지가 전달된다. 입력에 이름이 포함되지 않은 경우는 존재하지 않는다.
# 출력:
# 작성자로 추정되는 사람의 이름을 공백 문자 하나를 두고 한 줄에 출력한다.
#
# name_list = ['전지환', ]  # name_list를 완성할 것
# candidate = []
# letter = '강용황제갈김허임이게뭔개소리야박근주인남전영진짜곽도조환백수광종최희화홍호편재현규형해옥구슬솔민달팽정지상렬창렬'
# for __(a)__ in __(b)__:
#     # 변수 선언
#     for c in __(c)__:
#         if __(d)__:
#             # 조건에 해당할 시 해야할 동작
#         if __(e)__:
#             candidate.append(__(f)__)
# print(*candidate)
