name_list = ['강정수', '곽효선', '김동영', '김진영', '김혛규', '남지수', '문수민', '박단비',
             '박종혁', '백재희', '안현성', '이상수', '이해진', '임규환', '임솔이', '전근렬',
             '전인구', '전지환', '조인화', '주진홍', '최용수', '편수지']


# name_list = ['전지환', ]

letter = '''
안녕 상수야
넌 내가 누군지 모르지 왼손어렵네
반말해서 너보다 나이가 많다고 생각하겠지만 그렇게 생각하면
안돼. 이 정도 봤으면 어려도 말을 놓을 때가 되었지.
맞추면 내 최애 과자 초코하임을 증정할게
솔직히 이 정도면 맞추기 쉽다 ㅇㅈ?
실은 과자 사오는 건 깜빡해서 월요일에 줄게 물론 맞춘다면.
틀리면 내가 먹음
'''

candidate = []
for student_name in name_list:
    idx = 0
    for c in letter:
        if student_name[idx] == c:
            idx += 1
        if idx == 3:
            candidate.append(student_name)
            break
print(*candidate)

# SSAFY 구미캠퍼스 PYTHON 1반은 '마니또'라는 게임을 진행 중이다!
# 게임 중 작은 미션으로 반 전원은 마니또에게 자신의 이름이 숨겨진 편지를 전달해야 한다.
# 현성이가 전달받은 편지에는 다음과 같은 문구가 적혀있었다.
# '강용황제갈김허임이게뭔개소리야박근주인남전영진짜곽도조환백수광종최희화홍호편재현규형해옥구슬솔민달팽정지상렬창렬'
# 마니또에게서 받은 편지를 해독하고 마니또를 찾아내는 프로그램을 작성하시오.
# 입력:
# 마니또에게서 받은 편지가 전달된다. 입력에 이름이 포함되지 않은 경우는 존재하지 않는다.
# 출력:
# 작성자로 추정되는 사람의 이름을 공백 문자 하나를 두고 한 줄에 출력한다.
#
# name_list = ['전지환', ]  # name_list를 완성할 것
# candidate = []
# letter = '강용황제갈김허임이게뭔개소리야박근주인남전영진짜곽도조환백수광종최희화홍호편재현규형해옥구슬솔민달팽정지상렬창렬'
# for __(a)__ in __(b)__:
#     # 변수 선언
#     for c in __(c)__:
#         if __(d)__:
#             # 조건에 해당할 시 해야할 동작
#         if __(e)__:
#             candidate.append(__(f)__)
# print(*candidate)
