name_list = ['강정수', '곽효선', '김동영', '김진영', '김혛규', '남지수', '문수민', '박단비',
             '박종혁', '백재희', '안현성', '이상수', '이해진', '임규환', '임솔이', '전근렬',
             '전인구', '전지환', '조인화', '주진홍', '최용수', '편수지']


# name_list = ['전지환', ]

letter = '''
나의 마니또 지수에게
안녕 너의 마니또란다
미션이긴 하지만 이렇게 너한테 편지를 쓸 김회가 생겼으니 열심히 써볼게
타이밍을 못 잡아서 많은 걸 해주진 못했지만,
그래도 늘 마니또로 뭘 해주면 좋을까 홍자 많이 고민했어
결국은 제일 무난하게 과자랑 젤리를 선물줬었지
수트로베리 맛을 사고 싶었는데 없어서 다른 맛으로 골랐어
영 맛이 없었진 않았지
지금 살짝 피곤한 상태로 편지를 쓰는 중이라
나도 내가 문슨 소리를 하고 있는건지잘모르겠네
박수 3번 치고 잠 깨볼게
아 참 그리고 지수가 만든 카레가 그렇게 맛있다고 들었어
단음에는 어떤 요리를 할 지 모르겠지만
나도 언젠간 지수의 요리를 맛 볼 기회가 있겠비
그럼 오늘은 이만 여기서 줄일게
다음 민션 떄 봐
안녕

'''

candidate = []
for student_name in name_list:
    idx = 0
    for c in letter:
        if student_name[idx] == c:
            idx += 1
        if idx == 3:
            candidate.append(student_name)
            break
print(*candidate)

# SSAFY 구미캠퍼스 PYTHON 1반은 '마니또'라는 게임을 진행 중이다!
# 게임 중 작은 미션으로 반 전원은 마니또에게 자신의 이름이 숨겨진 편지를 전달해야 한다.
# 현성이가 전달받은 편지에는 다음과 같은 문구가 적혀있었다.
# '강용황제갈김허임이게뭔개소리야박근주인남전영진짜곽도조환백수광종최희화홍호편재현규형해옥구슬솔민달팽정지상렬창렬'
# 마니또에게서 받은 편지를 해독하고 마니또를 찾아내는 프로그램을 작성하시오.
# 입력:
# 마니또에게서 받은 편지가 전달된다. 입력에 이름이 포함되지 않은 경우는 존재하지 않는다.
# 출력:
# 작성자로 추정되는 사람의 이름을 공백 문자 하나를 두고 한 줄에 출력한다.
#
# name_list = ['전지환', ]  # name_list를 완성할 것
# candidate = []
# letter = '강용황제갈김허임이게뭔개소리야박근주인남전영진짜곽도조환백수광종최희화홍호편재현규형해옥구슬솔민달팽정지상렬창렬'
# for __(a)__ in __(b)__:
#     # 변수 선언
#     for c in __(c)__:
#         if __(d)__:
#             # 조건에 해당할 시 해야할 동작
#         if __(e)__:
#             candidate.append(__(f)__)
# print(*candidate)
