############## 주의 ##############
# 입력을 받기위한 input 함수는 절대 사용하지 않습니다.
# 내장 함수 sum, min, max, len 함수를 사용하지 않습니다.
# 사용시 감점처리 되니 반드시 확인 바랍니다.
def sum_digits(number):
    if number < 10:       # 함수에 넣은 숫자가 한자리 수라면 재귀 탈출
        return number
    a = number % 10       # 나머지는 답에 더한다.
    d = number // 10      # 몫은 아직 한자리가 아니며 더할 숫자들의 묶음이다
    return a + sum_digits(d)  # 재귀 돌입
    # 여기에 코드를 작성하여 함수를 완성합니다.
    
    
    
# 아래 코드는 실행 확인을 위한 코드입니다.
if __name__ == '__main__':
    # 예시 코드는 수정하지 마세요.
    print(sum_digits(123))  # => 6
    # 여기부터 아래에 추가 테스트를 위한 코드 작성 가능합니다.
    